Revit 2027 API
TableSectionData.SetCellStyle(TableCellStyle) Method
 Sets a section's style
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void SetCellStyle(
	TableCellStyle Style
)
Public Sub SetCellStyle (
	Style As TableCellStyle
)
public:
void SetCellStyle(
	TableCellStyle^ Style
)
member SetCellStyle :
        Style : TableCellStyle -> unit
Parameters
Style TableCellStyle
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 For standard schedule, must set the TableCellStyleOverrideOptions in the TableCellStyle to override this section.
See Also
Reference
TableSectionData Class
SetCellStyle Overload
Autodesk.Revit.DB Namespace